&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЛокальноеХранилище.МастерПарольУжеУстановлен() Тогда
		Элементы.ИнформацияПервыйВвод.Видимость = Ложь;
	Иначе
		Элементы.ИнформацияПовтроныйВвод.Видимость = Ложь;
	КонецЕсли;
	ОсталосьПопыток = НастройкиКонфигурацииПовтИсп.МаксимальноеКоличествоПопытокВводаМастерПароля();
	Элементы.ИнформацияПовтроныйВвод.Заголовок = СтрШаблон(Элементы.ИнформацияПовтроныйВвод.Заголовок, ОсталосьПопыток);
КонецПроцедуры

&НаКлиенте
Процедура МатерПарольНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Элемент.РежимПароля = Не Элемент.РежимПароля;
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	Если Не ЗначениеЗаполнено(МастерПароль) Тогда
		Сообщить("Пароль не может быть пустым");
		Возврат;
	КонецЕсли;
	Если ПроверитьМастерПарольНаСеврере() Тогда
		МастерПарольКлиент.Установить(МастерПароль);
		Закрыть();
	Иначе
		ОсталосьПопыток = ОсталосьПопыток - 1;
		Если ОсталосьПопыток > 0 Тогда
			ПоказатьПредупреждение(Новый ОписаниеОповещения, СтрШаблон("Неверный мастре пароль! Осталось попыток: %1", ОсталосьПопыток));
		Иначе
			ЗаблокироватьПользователяНаСервере();
			ЗавершитьРаботуСистемы(Ложь, Ложь);
		КонецЕсли; 
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПроверитьМастерПарольНаСеврере()
	Возврат ЛокальноеХранилище.ПроверитьМастерПароль(МастерПароль);
КонецФункции

&НаСервере
Процедура ЗаблокироватьПользователяНаСервере()
	ПользователиПривилегированный.ЗаблокироватьПользователя();
КонецПроцедуры
