
Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	Если Не Параметры.Свойство("Ключ") Тогда
		Возврат;
	КонецЕсли;
	Если Параметры.Ключ.ТочкаМаршрута = ПредопределенноеЗначение("БизнесПроцесс.ЗаявкаНаДоступ.ТочкаМаршрута.СогласоватьДоступ") Тогда
		ВыбраннаяФорма = "ФормаСогласованияДоступа";
		СтандартнаяОбработка = Ложь;
	ИначеЕсли Параметры.Ключ.ТочкаМаршрута = ПредопределенноеЗначение("БизнесПроцесс.ЗаявкаНаДоступ.ТочкаМаршрута.ПеречитатьЛокальныйКеш") Тогда
		ВыбраннаяФорма = "ФормаПеречитатьЛокальныйКеш";
		СтандартнаяОбработка = Ложь;
	ИначеЕсли Параметры.Ключ.ТочкаМаршрута = ПредопределенноеЗначение("БизнесПроцесс.ЗаявкаНаПубликацию.ТочкаМаршрута.СогласоватьПубликацию") Тогда
		ВыбраннаяФорма = "ФормаСогласоватьПубликацию";
		СтандартнаяОбработка = Ложь;
	ИначеЕсли Параметры.Ключ.ТочкаМаршрута = ПредопределенноеЗначение("БизнесПроцесс.ЗаявкаНаПубликацию.ТочкаМаршрута.ОпубликоватьСекрет") Тогда
		ВыбраннаяФорма = "ФормаОпубликоватьСекрет";
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры
