
Процедура ПередЗаписью(Отказ)
	Если Не ЗначениеЗаполнено(Исполнитель) Тогда
		Если РольИсполнителя = Справочники.РолиИсполнителей.Робот Тогда
			Исполнитель = Справочники.Пользователи.Робот;
		ИначеЕсли РольИсполнителя = Справочники.РолиИсполнителей.Администратор Тогда
			Исполнитель = Справочники.Пользователи.НайтиПоНаименованию("Администратор")
		ИначеЕсли РольИсполнителя = Справочники.РолиИсполнителей.Пользователь Тогда
			Исполнитель = БизнесПроцесс.Пользователь;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
