
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Настройка = Список.Параметры.Элементы.Найти("ТекущийПользователь");
	Настройка.Значение = ПараметрыСеанса.ТекущийПользователь;
	Настройка.Использование = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаявкуНаДоступ(Команда)
	ОткрытьФорму("БизнесПроцесс.ЗаявкаНаДоступ.ФормаОбъекта");
КонецПроцедуры

&НаКлиенте
Процедура МоиЗадачи(Команда)
	ОткрытьФорму("ОбщаяФорма.МоиЗадачи");
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЛокальноеХранилищеСекретов(Команда)
	ОбновитьЛокальноеХранилищеСекретовНаСервере(МастерПарольКлиент.Получить());
	Элементы.Список.Обновить();
КонецПроцедуры

&НаСервере
Процедура ОбновитьЛокальноеХранилищеСекретовНаСервере(МастерПароль)
	Если ЗначениеЗаполнено(МастерПароль) Тогда
		ЛокальноеХранилище.ОбновитьЛокальноеХранилищеСекретов(МастерПароль);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ЗаписьЛокальногоХранилища" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СменитьМастерПароль(Команда)
	
КонецПроцедуры


