
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Настройка = Задачи.Параметры.Элементы.Найти("ТекущийПользователь");
	Настройка.Значение = ПараметрыСеанса.ТекущийПользователь;
	Настройка.Использование = Истина;
	Элементы.ЗадачиВыполнениеЗадачРоботом.Видимость = РольДоступна(Метаданные.Роли.ПолныеПрава);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Элементы.Задачи.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ВыполнениеЗадачРоботом(Команда)
	ВыполнениеЗадачРоботомНаСервере();
	Элементы.Задачи.Обновить();
КонецПроцедуры

&НаСервере
Процедура ВыполнениеЗадачРоботомНаСервере()
	РегламентынеОперации.ВыполнениеЗадачРоботом();
КонецПроцедуры

