&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Пользователь = Объект.БизнесПроцесс.Пользователь;
	Секрет = Объект.БизнесПроцесс.Секрет;
КонецПроцедуры

&НаКлиенте
Процедура Согласовать(Команда)
	СогласоватьНаСервере(Истина);
	Оповестить("ОбновитьСписокЗадач");
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Отклонить(Команда)
	СогласоватьНаСервере(Ложь);
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура СогласоватьНаСервере(РезультатСогласования)
	ИсторияДоступа.ЗалогироватьСобытие(Секрет, Перечисления.Действия.ЗапросНаДоступ);
	БП = Объект.БизнесПроцесс.ПолучитьОбъект();
	БП.ПубликацияСогласована = РезультатСогласования;
	БП.Записать();
	ЗадачаОбъект = РеквизитФормыВЗначение("Объект");
	ЗадачаОбъект.ВыполнитьЗадачу();
КонецПроцедуры
