&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Пользователь = Объект.БизнесПроцесс.Пользователь;
	НаименованиеСекретаСейфа = Объект.БизнесПроцесс.НаименованиеСекретаСейфа;
	ОписаниеПодтвержденияДоступа = Объект.БизнесПроцесс.ОписаниеПодтвержденияДоступа;
КонецПроцедуры

&НаКлиенте
Процедура Согласовать(Команда)
	Если Не ЗначениеЗаполнено(СекретСейф) Тогда
		Сообщить("Необходимо указать ссылку на секрет или сейф для открытия доступа");
		Возврат;
	КонецЕсли;
	СогласоватьНаСервере(Истина);
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Отклонить(Команда)
	СогласоватьНаСервере(Ложь);
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура СогласоватьНаСервере(РезультатСогласования)
	ИсторияДоступа.ЗалогироватьСобытие(СекретСейф, Перечисления.Действия.ЗапросНаДоступ);
	БП = Объект.БизнесПроцесс.ПолучитьОбъект();
	БП.Секрет = СекретСейф;
	БП.ДоступСогласован = РезультатСогласования;
	БП.Записать();
	ЗадачаОбъект = РеквизитФормыВЗначение("Объект");
	ЗадачаОбъект.ВыполнитьЗадачу();
КонецПроцедуры
