Функция НайтиСоздать(Наименование) Экспорт
	Результат = Справочники.Пользователи.НайтиПоНаименованию(Наименование, Истина);
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	НовыйПользователь = Справочники.Пользователи.СоздатьЭлемент();
	НовыйПользователь.Наименование = Наименование;
	НовыйПользователь.Записать();
	Возврат НовыйПользователь.Ссылка;
КонецФункции

Функция ЕстьПравоДобавленияСекретов() Экспорт
	Если РольДоступна(Метаданные.Роли.ПолныеПрава) Тогда
		Возврат Истина;
	КонецЕсли;
	Если РольДоступна(Метаданные.Роли.ДобавлениеСекретов) Тогда
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;
КонецФункции

Процедура ЗаблокироватьПользователя() Экспорт
	Объект = ПараметрыСеанса.ТекущийПользователь.ПолучитьОбъект();
	Объект.ПериодБлокировкиНачалаСеансов = ТекущаяДатаСеанса() + НастройкиКонфигурацииПовтИсп.ВремяБлокировкиПользователяПриИсчерпанииПопытокСекунд();
	Объект.Записать();
КонецПроцедуры

Функция ВходЗаблокирован() Экспорт
	Возврат ПараметрыСеанса.ТекущийПользователь.ПериодБлокировкиНачалаСеансов > ТекущаяДатаСеанса();
КонецФункции