#Область СлужебныйПрограммныйИнтерфейс

Функция АдресOpenBao() Экспорт
	Возврат Константы.АдресOpenBao.Получить();
КонецФункции

Функция ТокенOpenBao() Экспорт
	Возврат Константы.ТокенOpenBao.Получить();
КонецФункции

Функция МаксимальноеКоличествоПопытокВводаМастерПароля() Экспорт
	Возврат Константы.МаксимальноеКоличествоПопытокВводаМастерПароля.Получить();
КонецФункции

Функция ВремяБлокировкиПользователяПриИсчерпанииПопытокСекунд() Экспорт
	Возврат Константы.ВремяБлокировкиПользователяПриИсчерпанииПопыток.Получить() - '00010101';
КонецФункции

Функция ВремяАктуальностиМастерПароляСекунд() Экспорт
	Возврат Константы.ВремяАктуальностиМастерПароля.Получить() - '00010101';
КонецФункции

Функция ВремяАктуальностиБуфераОбменаСекунд() Экспорт
	Возврат Константы.ВремяАктуальностиБуфераОбмена.Получить() - '00010101';
КонецФункции

Функция ДанныеНовогоСекретаПоУмолчанию() Экспорт
	Результат = Новый Соответствие;
	Для Каждого Часть Из СтрРазделить(Константы.КлючиНовогоСекретаПоУмолчанию.Получить(), ",") Цикл
		Результат.Вставить(СокрЛП(Часть));
	КонецЦикла;
	Возврат Результат;
КонецФункции

#КонецОбласти