Перем _МастерПароль Экспорт;

Процедура ПередНачаломРаботыСистемы(Отказ)
	Если ПользователиПривилегированный.ВходЗаблокирован() Тогда
		ИсторияДоступа.ЗалогироватьСобытие(Неопределено, ПредопределенноеЗначение("Перечисление.Действия.БлокировкаВхода"));
		//Отказ = Истина;
		//ВызватьИсключение "Вам временно заблокирован вход";
	КонецЕсли;
	ИсторияДоступа.ЗалогироватьСобытие(Неопределено, ПредопределенноеЗначение("Перечисление.Действия.ЗапускПриложения"));
КонецПроцедуры

Процедура ПриНачалеРаботыСистемы()
	ОткрытьФорму("ОбщаяФорма.ВводМастерПароля");
КонецПроцедуры

Процедура СброситьМастерПароль() Экспорт
	МастерПарольКлиент.Установить("");
КонецПроцедуры
