
Процедура ПередЗаписью(Отказ)
	Если Не ЗначениеЗаполнено(Сейф) Тогда
		Сейф = Справочники.Сейфы.Личный;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Автор) Тогда
		Автор = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	Если ЭтоНовый() Тогда
		Если Сейф <> Справочники.Сейфы.Личный Тогда
			Если ПользователиПривилегированный.ЕстьПравоДобавленияСекретов() = Ложь Тогда
				ВызватьИсключение "Вам можно добавлять только личные секреты";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Для Каждого Строка Из Теги.НайтиСтроки(Новый Структура("Тег", "")) Цикл
		Теги.Удалить(Строка);
	КонецЦикла;
	ТегиСтрока = "#" + СтрСоединить(Теги.ВыгрузитьКолонку("Тег"), ", #");
	ТегиСтрока = СтрЗаменить(ТегиСтрока, "##", "#");
	Если ТегиСтрока = "#" Тогда
		ТегиСтрока = "";
	КонецЕсли;
КонецПроцедуры
