Функция Получить() Экспорт
	Если Не ЗначениеЗаполнено(_МастерПароль) Тогда
		ОткрытьФормуМодально("ОбщаяФорма.ВводМастерПароля");
	КонецЕсли;
	Возврат _МастерПароль;
КонецФункции

Функция Установить(Строка) Экспорт
	_МастерПароль = Строка;
	ВремяАктуальности = НастройкиКонфигурацииПовтИсп.ВремяАктуальностиМастерПароляСекунд();
	Если ЗначениеЗаполнено(_МастерПароль) И ЗначениеЗаполнено(ВремяАктуальности) Тогда
		ПодключитьОбработчикОжидания("СброситьМастерПароль", ВремяАктуальности, Истина);
	КонецЕсли;
КонецФункции

