
Процедура ДоступПредоставленПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = ПубликацияСогласована;
КонецПроцедуры

Процедура ОтправитьОповещениеСогласующемуПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	Исполнитель = Справочники.Пользователи.НайтиПоНаименованию("Администратор");
	Текст = СтрШаблон("Новое согласование публикации %1 для %2", Задача.БизнесПроцесс.Секрет, Задача.БизнесПроцесс.Пользователь);
	ОповещенияПереопределяемый.ОповеститьПользователя(Исполнитель, Перечисления.ВидКонтактнойИнформации.Телеграмм, Текст);
КонецПроцедуры

Процедура ДобавитьДоступПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	// Выполняется в кользовательском контексте для расшифрока сообщения
КонецПроцедуры

Процедура ОтправитьОповещениеОРезультатеСогласованияПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	Текст = СтрШаблон("По вашей заявку на публикацию %1 результат: %2", Задача.БизнесПроцесс.Секрет, "Отклонено");
	ОповещенияПереопределяемый.ОповеститьПользователя(Задача.БизнесПроцесс.Пользователь, Перечисления.ВидКонтактнойИнформации.Телеграмм, Текст);
КонецПроцедуры

Процедура СогласоватьДоступОбработкаПроверкиВыполнения(ТочкаМаршрутаБизнесПроцесса, Задача, Результат)
КонецПроцедуры

Процедура ОправитьОповещениеАдминистраторуПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	Исполнитель = Справочники.Пользователи.НайтиПоНаименованию("Администратор");
	Текст = СтрШаблон("Пользователь %2 завершил публикацию секрета %1 в OpenBao", Задача.БизнесПроцесс.Секрет, Задача.БизнесПроцесс.Пользователь);
	ОповещенияПереопределяемый.ОповеститьПользователя(Исполнитель, Перечисления.ВидКонтактнойИнформации.Телеграмм, Текст);
КонецПроцедуры
