
Процедура ДоступПредоставленПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = ДоступСогласован;
КонецПроцедуры

Процедура ОтправитьОповещениеСогласующемуПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	Текст = СтрШаблон("Новое согласование доступа %1 для %2", Задача.БизнесПроцесс.НаименованиеСекретаСейфа, Задача.БизнесПроцесс.Пользователь);
	ОповещенияПереопределяемый.ОповеститьПользователя(Задача.Исполнитель, Перечисления.ВидКонтактнойИнформации.Телеграмм, Текст);
КонецПроцедуры

Процедура ДобавитьДоступПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	Запись = РегистрыСведений.ПраваДоступа.СоздатьМенеджерЗаписи();
	Запись.Пользователь = Задача.БизнесПроцесс.Пользователь;
	Запись.СекретСейф = Задача.БизнесПроцесс.СекретСейф;
	Запись.Записать();
КонецПроцедуры

Процедура ОтправитьОповещениеОРезультатеСогласованияПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	Текст = "доступ согласован";
	Действие = Перечисления.Действия.ДоступСогласован;
	Если Не Задача.БизнесПроцесс.ДоступСогласован Тогда
		Текст = "доступ не согласован";
		Действие = Перечисления.Действия.ДоступНеСогласован;
	КонецЕсли;
	ИсторияДоступа.ЗалогироватьСобытие(Задача.БизнесПроцесс.СекретСейф, Действие);
	Текст = СтрШаблон("По вашей заявку на доступ %1 результат: %2", Задача.БизнесПроцесс.НаименованиеСекретаСейфа, Текст);
	ОповещенияПереопределяемый.ОповеститьПользователя(Задача.БизнесПроцесс.Пользователь, Перечисления.ВидКонтактнойИнформации.Телеграмм, Текст);
КонецПроцедуры

Процедура СогласоватьДоступОбработкаПроверкиВыполнения(ТочкаМаршрутаБизнесПроцесса, Задача, Результат)
КонецПроцедуры

Процедура ОтправитьОповещениеОтказСогласованияПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	ОтправитьОповещениеОРезультатеСогласованияПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ);
КонецПроцедуры

Процедура ПеречитатьЛокальныйКешПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	//ЛокальноеХранилище.ОбновитьЛокальноеХранилищеСекретов("ОткрытйКлюч");
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если Не ЗначениеЗаполнено(Пользователь) Тогда
		Пользователь = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
КонецПроцедуры
