&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СекретСейф = Объект.БизнесПроцесс.СекретСейф;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЛокальныйКеш(Команда)
	Если ВыполнитьЗадачуНаСервере(МастерПарольКлиент.Получить()) Тогда;
		Оповестить("ЗаписьЛокальногоХранилища");
		Оповестить("ОбновитьСписокЗадач");
		Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ВыполнитьЗадачуНаСервере(ОткрытыйКлюч)
	Если ЗначениеЗаполнено(ОткрытыйКлюч) Тогда
		ЛокальноеХранилище.ОбновитьЛокальноеХранилищеСекретов(ОткрытыйКлюч);
		ЗадачаОбъект = РеквизитФормыВЗначение("Объект");
		ЗадачаОбъект.ВыполнитьЗадачу();
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

