
&НаКлиенте
Процедура СоздатьПользователейИБ(Команда)
	СоздатьПользователейИБНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьПользователейИБНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Поиск = ПользователиИнформационнойБазы.НайтиПоИмени(Выборка.Наименование);
		Если Поиск = Неопределено Тогда
			Юзер = ПользователиИнформационнойБазы.СоздатьПользователя();
			Юзер.ПолноеИмя = Выборка.Наименование;
			Юзер.Имя = Выборка.Наименование;
			Юзер.АутентификацияСтандартная = Истина;
			Юзер.Роли.Добавить(Метаданные.Роли.Пользователь);
			Юзер.Записать();
			Сообщить("Создан " + Выборка.Наименование);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
